# This Table is generated automaticly by yarob/tools/gen_verb_inflect.py
# Based on yarob/data-source/verbs.csv
TABLE_TENSE_PRONOUN_INFLECTION={'الأمر': {'أنت': {'case': 'مبني على السكون',
                   'case_weak': '',
                   'cause': '',
                   "description": 'فعل أمر',
                   'extra': '',
                   'subject': 'والفاعل ضمير مستتر وجوبًا تقديره أنتَ'},
           'أنتم': {'case': 'مبني على حذف النون',
                    'case_weak': '',
                    'cause': 'لاتصاله بواو الجماعة',
                    "description": 'فعل أمر',
                    'extra': '',
                    'subject': ' والواو: ضمير متصل مبني في محل رفع فاعل'},
           'أنتما': {'case': 'مبني على حذف النون',
                     'case_weak': '',
                     'cause': 'لاتصاله بألف الاثنين',
                     "description": 'فعل أمر',
                     'extra': '',
                     'subject': 'وألف الاثنين: ضمير متصل مبني في محل رفع فاعل'},
           'أنتما مؤ': {'case': 'مبني على حذف النون',
                        'case_weak': '',
                        'cause': 'لاتصاله بألف الاثنين',
                        "description": 'فعل أمر',
                        'extra': '',
                        'subject': 'وألف الاثنين: ضمير متصل مبني في محل رفع '
                                   'فاعل'},
           'أنتن': {'case': 'مبني على السكون',
                    'case_weak': '',
                    'cause': 'لاتصاله بنون النسوة',
                    "description": 'فعل أمر',
                    'extra': '',
                    'subject': 'والنون: ضمير متصل مبني في محل رفع فاعل'},
           'أنتِ': {'case': 'مبني على حذف النون',
                    'case_weak': '',
                    'cause': 'لاتصاله بياء المخاطبة',
                    "description": 'فعل أمر',
                    'extra': '',
                    'subject': 'وياء المخاطبة ضمير متصل مبني في محل رفع فاعل'}},
 'الأمر المؤكد': {'أنت': {'case': 'مبني على الفتح',
                          'case_weak': '',
                          'cause': 'لاتصاله بنون التوكيد',
                          "description": 'فعل أمر',
                          'extra': '',
                          'subject': 'والفاعل ضمير مستتر وجوبًا تقديره أنتَ'},
                  'أنتم': {'case': '',
                           'case_weak': '',
                           'cause': '',
                           "description": 'فعل أمر',
                           'extra': '',
                           'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                      'فاعل'},
                  'أنتما': {'case': '',
                            'case_weak': '',
                            'cause': '',
                            "description": 'فعل أمر',
                            'extra': '',
                            'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                       'رفع فاعل'},
                  'أنتما مؤ': {'case': '',
                               'case_weak': '',
                               'cause': '',
                               "description": 'فعل أمر',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع فاعل'},
                  'أنتن': {'case': '',
                           'case_weak': '',
                           'cause': '',
                           "description": 'فعل أمر',
                           'extra': '',
                           'subject': 'والنون: ضمير متصل مبني في محل رفع فاعل'},
                  'أنتِ': {'case': '',
                           'case_weak': '',
                           'cause': '',
                           "description": 'فعل أمر',
                           'extra': '',
                           'subject': 'وياء المخاطبة ضمير متصل مبني في محل رفع '
                                      'فاعل'}},
 'الماضي المجهول': {'أنا': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بالتاء المتحركة',
                            "description": 'فعل ماض مبني للمجهول',
                            'extra': '',
                            'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                    'أنت': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بالتاء المتحركة',
                            "description": 'فعل ماض مبني للمجهول',
                            'extra': '',
                            'subject': 'والتاء: ضمير متصل مبني في محل رفع نائب '
                                       'فاعل'},
                    'أنتم': {'case': 'مبني على السكون',
                             'case_weak': '',
                             'cause': 'لاتصاله بالتاء المتحركة',
                             "description": 'فعل ماض مبني للمجهول',
                             'extra': '',
                             'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                        'نائب فاعل'},
                    'أنتما': {'case': 'مبني على السكون',
                              'case_weak': '',
                              'cause': 'لاتصاله بالتاء المتحركة',
                              "description": 'فعل ماض مبني للمجهول',
                              'extra': '',
                              'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                         'نائب فاعل'},
                    'أنتما مؤ': {'case': 'مبني على السكون',
                                 'case_weak': '',
                                 'cause': 'لاتصاله بالتاء المتحركة',
                                 "description": 'فعل ماض مبني للمجهول',
                                 'extra': '',
                                 'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                            'نائب فاعل'},
                    'أنتن': {'case': 'مبني على السكون',
                             'case_weak': '',
                             'cause': 'لاتصاله بالتاء المتحركة',
                             "description": 'فعل ماض مبني للمجهول',
                             'extra': '',
                             'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                        'نائب فاعل'},
                    'أنتِ': {'case': 'مبني على السكون',
                             'case_weak': '',
                             'cause': 'لاتصاله بالتاء المتحركة',
                             "description": 'فعل ماض مبني للمجهول',
                             'extra': '',
                             'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                        'نائب فاعل'},
                    'نحن': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': ' لاتصاله بـ (نا) الفاعلين',
                            "description": 'فعل ماض مبني للمجهول',
                            'extra': '',
                            'subject': 'ونا: ضمير متصل مبني في محل رفع نائب '
                                       'فاعل'},
                    'هم': {'case': 'مبني على الضم',
                           'case_weak': '',
                           'cause': 'لاتصاله بواو الجماعة',
                           "description": 'فعل ماض مبني للمجهول',
                           'extra': '',
                           'subject': ' والواو: ضمير متصل مبني في محل رفع نائب '
                                      'فاعل'},
                    'هما': {'case': 'مبني على الفتح الظاهر',
                            'case_weak': 'مبني على الفتح المقدّر منع من ظهوره '
                                         'التعذّر',
                            'cause': '',
                            "description": 'فعل ماض مبني للمجهول',
                            'extra': '',
                            'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                       'رفع نائب فاعل'},
                    'هما مؤ': {'case': 'مبني على الفتح الظاهر',
                               'case_weak': 'مبني على الفتح المقدّر منع من '
                                            'ظهوره التعذّر',
                               'cause': '',
                               "description": 'فعل ماض مبني للمجهول',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع نائب فاعل'},
                    'هن': {'case': 'مبني على السكون',
                           'case_weak': '',
                           'cause': 'لاتصاله بنون النسوة',
                           "description": 'فعل ماض مبني للمجهول',
                           'extra': '',
                           'subject': ' والنون: ضمير متصل مبني في محل رفع نائب '
                                      'فاعل'},
                    'هو': {'case': 'مبني على الفتح الظاهر على آخره',
                           'case_weak': 'مبني على الفتح المقدّر منع من ظهوره '
                                        'التعذّر',
                           'cause': '',
                           "description": 'فعل ماض مبني للمجهول',
                           'extra': '',
                           'subject': ''},
                    'هي': {'case': 'مبني على الفتح الظاهر على آخره',
                           'case_weak': 'مبني على الفتح المقدّر منع من ظهوره '
                                        'التعذّر',
                           'cause': '',
                           "description": 'فعل ماض مبني للمجهول',
                           'extra': '',
                           'subject': ''}},
 'الماضي المعلوم': {'أنا': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بالتاء المتحركة',
                            "description": 'فعل ماض',
                            'extra': '',
                            'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                    'أنت': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بالتاء المتحركة',
                            "description": 'فعل ماض',
                            'extra': '',
                            'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                    'أنتم': {'case': 'مبني على السكون',
                             'case_weak': '',
                             'cause': 'لاتصاله بالتاء المتحركة',
                             "description": 'فعل ماض',
                             'extra': '',
                             'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                        'فاعل'},
                    'أنتما': {'case': 'مبني على السكون',
                              'case_weak': '',
                              'cause': 'لاتصاله بالتاء المتحركة',
                              "description": 'فعل ماض',
                              'extra': '',
                              'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                    'أنتما مؤ': {'case': 'مبني على السكون',
                                 'case_weak': '',
                                 'cause': 'لاتصاله بالتاء المتحركة',
                                 "description": 'فعل ماض',
                                 'extra': '',
                                 'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                            'فاعل'},
                    'أنتن': {'case': 'مبني على السكون',
                             'case_weak': '',
                             'cause': 'لاتصاله بالتاء المتحركة',
                             "description": 'فعل ماض',
                             'extra': '',
                             'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                        'فاعل'},
                    'أنتِ': {'case': 'مبني على السكون',
                             'case_weak': '',
                             'cause': 'لاتصاله بالتاء المتحركة',
                             "description": 'فعل ماض',
                             'extra': '',
                             'subject': 'والتاء: ضمير متصل مبني في محل رفع '
                                        'فاعل'},
                    'نحن': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': ' لاتصاله بـ (نا) الفاعلين',
                            "description": 'فعل ماض',
                            'extra': '',
                            'subject': 'ونا: ضمير متصل مبني في محل رفع فاعل'},
                    'هم': {'case': 'مبني على الضم',
                           'case_weak': '',
                           'cause': 'لاتصاله بواو الجماعة',
                           "description": 'فعل ماض',
                           'extra': '',
                           'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                      'فاعل'},
                    'هما': {'case': 'مبني على الفتح الظاهر',
                            'case_weak': 'مبني على الفتح المقدّر منع من ظهوره '
                                         'التعذّر',
                            'cause': '',
                            "description": 'فعل ماض',
                            'extra': '',
                            'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                       'رفع فاعل'},
                    'هما مؤ': {'case': 'مبني على الفتح الظاهر',
                               'case_weak': 'مبني على الفتح المقدّر منع من '
                                            'ظهوره التعذّر',
                               'cause': '',
                               "description": 'فعل ماض',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع فاعل'},
                    'هن': {'case': 'مبني على السكون',
                           'case_weak': '',
                           'cause': 'لاتصاله بنون النسوة',
                           "description": 'فعل ماض',
                           'extra': '',
                           'subject': ' والنون: ضمير متصل مبني في محل رفع '
                                      'فاعل'},
                    'هو': {'case': 'مبني على الفتح الظاهر على آخره',
                           'case_weak': 'مبني على الفتح المقدّر منع من ظهوره '
                                        'التعذّر',
                           'cause': '',
                           "description": 'فعل ماض',
                           'extra': '',
                           'subject': ''},
                    'هي': {'case': 'مبني على الفتح الظاهر على آخره',
                           'case_weak': 'مبني على الفتح المقدّر منع من ظهوره '
                                        'التعذّر',
                           'cause': '',
                           "description": 'فعل ماض',
                           'extra': '',
                           'subject': ''}},
 'المضارع المؤكد الثقيل': {'أنا': {'case': 'مبني على الفتح',
                                   'case_weak': '',
                                   'cause': 'لاتصاله بنون التوكيد',
                                   "description": 'فعل مضارع مؤكّد',
                                   'extra': 'ونون التوكيد لا محل لها من '
                                            'الإعراب',
                                   'subject': 'والفاعل ضمير مستتر وجوبًا '
                                              'تقديره أنا'},
                           'أنت': {'case': 'مبني على الفتح',
                                   'case_weak': '',
                                   'cause': 'لاتصاله بنون التوكيد',
                                   "description": 'فعل مضارع مؤكّد',
                                   'extra': 'ونون التوكيد لا محل لها من '
                                            'الإعراب',
                                   'subject': 'والفاعل ضمير مستتر وجوبًا '
                                              'تقديره أنتَ'},
                           'أنتم': {'case': 'مرفوع وعلامة رفعه النون المحذوفة ',
                                    'case_weak': '',
                                    'cause': 'لاتصاله بنون التوكيد ولأنه من '
                                             'الأفعال الخمسة',
                                    "description": 'فعل مضارع مؤكّد',
                                    'extra': 'ونون التوكيد لا محل لها من '
                                             'الإعراب',
                                    'subject': ' والواو: واو الجماعة المحذوفة '
                                               'ضمير متصل مبني في محل رفع '
                                               'فاعل'},
                           'أنتما': {'case': 'مرفوع وعلامة رفعه النون '
                                             'المحذوفة ',
                                     'case_weak': '',
                                     'cause': 'لاتصاله بنون التوكيد ولأنه من '
                                              'الأفعال الخمسة',
                                     "description": 'فعل مضارع مؤكّد',
                                     'extra': 'ونون التوكيد لا محل لها من '
                                              'الإعراب',
                                     'subject': 'وألف الاثنين: ضمير متصل مبني '
                                                'في محل رفع فاعل'},
                           'أنتما مؤ': {'case': 'مرفوع وعلامة رفعه النون '
                                                'المحذوفة ',
                                        'case_weak': '',
                                        'cause': 'لاتصاله بنون التوكيد ولأنه '
                                                 'من الأفعال الخمسة',
                                        "description": 'فعل مضارع مؤكّد',
                                        'extra': 'ونون التوكيد لا محل لها من '
                                                 'الإعراب',
                                        'subject': 'وألف الاثنين: ضمير متصل '
                                                   'مبني في محل رفع فاعل'},
                           'أنتن': {'case': 'مبني على السكون',
                                    'case_weak': '',
                                    'cause': 'لاتصاله بنون النسوة',
                                    "description": 'فعل مضارع مؤكّد',
                                    'extra': 'ونون التوكيد لا محل لها من '
                                             'الإعراب',
                                    'subject': 'والنون: ضمير متصل مبني في محل '
                                               'رفع فاعل'},
                           'أنتِ': {'case': 'مرفوع وعلامة رفعه النون المحذوفة ',
                                    'case_weak': '',
                                    'cause': 'لاتصاله بنون التوكيد ولأنه من '
                                             'الأفعال الخمسة',
                                    "description": 'فعل مضارع مؤكّد',
                                    'extra': 'ونون التوكيد لا محل لها من '
                                             'الإعراب',
                                    'subject': 'وياء المخاطبة المحذوفة ضمير '
                                               'متصل مبني في محل رفع فاعل'},
                           'نحن': {'case': 'مبني على الفتح',
                                   'case_weak': '',
                                   'cause': 'لاتصاله بنون التوكيد',
                                   "description": 'فعل مضارع مؤكّد',
                                   'extra': 'ونون التوكيد لا محل لها من '
                                            'الإعراب',
                                   'subject': 'ونا: ضمير متصل مبني في محل رفع '
                                              'فاعل'},
                           'هم': {'case': 'مرفوع وعلامة رفعه النون المحذوفة ',
                                  'case_weak': '',
                                  'cause': 'لاتصاله بنون التوكيد ولأنه من '
                                           'الأفعال الخمسة',
                                  "description": 'فعل مضارع مؤكّد',
                                  'extra': 'ونون التوكيد لا محل لها من الإعراب',
                                  'subject': ' والواو: واو الجماعة المحذوفة '
                                             'ضمير متصل مبني في محل رفع فاعل'},
                           'هما': {'case': 'مرفوع وعلامة رفعه النون المحذوفة ',
                                   'case_weak': '',
                                   'cause': 'لاتصاله بنون التوكيد ولأنه من '
                                            'الأفعال الخمسة',
                                   "description": 'فعل مضارع مؤكّد',
                                   'extra': 'ونون التوكيد لا محل لها من '
                                            'الإعراب',
                                   'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                              'محل رفع فاعل'},
                           'هما مؤ': {'case': 'مرفوع وعلامة رفعه النون '
                                              'المحذوفة ',
                                      'case_weak': '',
                                      'cause': 'لاتصاله بنون التوكيد ولأنه من '
                                               'الأفعال الخمسة',
                                      "description": 'فعل مضارع مؤكّد',
                                      'extra': 'ونون التوكيد لا محل لها من '
                                               'الإعراب',
                                      'subject': 'وألف الاثنين: ضمير متصل مبني '
                                                 'في محل رفع فاعل'},
                           'هن': {'case': 'مبني على السكون',
                                  'case_weak': '',
                                  'cause': 'لاتصاله بنون النسوة',
                                  "description": 'فعل مضارع مؤكّد',
                                  'extra': 'ونون التوكيد لا محل لها من الإعراب',
                                  'subject': 'والنون: ضمير متصل مبني في محل '
                                             'رفع فاعل'},
                           'هو': {'case': 'مبني على الفتح',
                                  'case_weak': '',
                                  'cause': 'لاتصاله بنون التوكيد',
                                  "description": 'فعل مضارع مؤكّد',
                                  'extra': 'ونون التوكيد لا محل لها من الإعراب',
                                  'subject': ''},
                           'هي': {'case': 'مبني على الفتح',
                                  'case_weak': '',
                                  'cause': 'لاتصاله بنون التوكيد',
                                  "description": 'فعل مضارع مؤكّد',
                                  'extra': 'ونون التوكيد لا محل لها من الإعراب',
                                  'subject': ''}},
 'المضارع المؤكد الثقيل المجهول ': {'أنا': {'case': 'مبني على الفتح',
                                            'case_weak': '',
                                            'cause': 'لاتصاله بنون التوكيد',
                                            "description": 'فعل مضارع مؤكّد '
                                                          'مبني للمجهول',
                                            'extra': 'ونون التوكيد لا محل لها '
                                                     'من الإعراب',
                                            'subject': 'ونائب الفاعل ضمير '
                                                       'مستتر وجوبًا تقديره '
                                                       'أنا'},
                                    'أنت': {'case': 'مبني على الفتح',
                                            'case_weak': '',
                                            'cause': 'لاتصاله بنون التوكيد',
                                            "description": 'فعل مضارع مؤكّد '
                                                          'مبني للمجهول',
                                            'extra': 'ونون التوكيد لا محل لها '
                                                     'من الإعراب',
                                            'subject': 'ونائب الفاعل ضمير '
                                                       'مستتر وجوبًا تقديره '
                                                       'أنتَ'},
                                    'أنتم': {'case': 'مرفوع وعلامة رفعه النون '
                                                     'المحذوفة ',
                                             'case_weak': '',
                                             'cause': 'لاتصاله بنون التوكيد '
                                                      'ولأنه من الأفعال الخمسة',
                                             "description": 'فعل مضارع مؤكّد '
                                                           'مبني للمجهول',
                                             'extra': 'ونون التوكيد لا محل لها '
                                                      'من الإعراب',
                                             'subject': ' والواو: واو الجماعة '
                                                        'المحذوفة ضمير متصل '
                                                        'مبني في محل رفع نائب '
                                                        'فاعل'},
                                    'أنتما': {'case': 'مرفوع وعلامة رفعه النون '
                                                      'المحذوفة ',
                                              'case_weak': '',
                                              'cause': 'لاتصاله بنون التوكيد '
                                                       'ولأنه من الأفعال '
                                                       'الخمسة',
                                              "description": 'فعل مضارع مؤكّد '
                                                            'مبني للمجهول',
                                              'extra': 'ونون التوكيد لا محل '
                                                       'لها من الإعراب',
                                              'subject': 'وألف الاثنين: ضمير '
                                                         'متصل مبني في محل رفع '
                                                         'نائب فاعل'},
                                    'أنتما مؤ': {'case': 'مرفوع وعلامة رفعه '
                                                         'النون المحذوفة ',
                                                 'case_weak': '',
                                                 'cause': 'لاتصاله بنون '
                                                          'التوكيد ولأنه من '
                                                          'الأفعال الخمسة',
                                                 "description": 'فعل مضارع '
                                                               'مؤكّد مبني '
                                                               'للمجهول',
                                                 'extra': 'ونون التوكيد لا محل '
                                                          'لها من الإعراب',
                                                 'subject': 'وألف الاثنين: '
                                                            'ضمير متصل مبني في '
                                                            'محل رفع نائب '
                                                            'فاعل'},
                                    'أنتن': {'case': 'مبني على السكون',
                                             'case_weak': '',
                                             'cause': 'لاتصاله بنون النسوة',
                                             "description": 'فعل مضارع مؤكّد '
                                                           'مبني للمجهول',
                                             'extra': 'ونون التوكيد لا محل لها '
                                                      'من الإعراب',
                                             'subject': 'والنون: ضمير متصل '
                                                        'مبني في محل رفع نائب '
                                                        'فاعل'},
                                    'أنتِ': {'case': 'مرفوع وعلامة رفعه النون '
                                                     'المحذوفة ',
                                             'case_weak': '',
                                             'cause': 'لاتصاله بنون التوكيد '
                                                      'ولأنه من الأفعال الخمسة',
                                             "description": 'فعل مضارع مؤكّد '
                                                           'مبني للمجهول',
                                             'extra': 'ونون التوكيد لا محل لها '
                                                      'من الإعراب',
                                             'subject': 'وياء المخاطبة '
                                                        'المحذوفة ضمير متصل '
                                                        'مبني في محل رفع نائب '
                                                        'فاعل'},
                                    'نحن': {'case': 'مبني على الفتح',
                                            'case_weak': '',
                                            'cause': 'لاتصاله بنون التوكيد',
                                            "description": 'فعل مضارع مؤكّد '
                                                          'مبني للمجهول',
                                            'extra': 'ونون التوكيد لا محل لها '
                                                     'من الإعراب',
                                            'subject': 'ونا: ضمير متصل مبني في '
                                                       'محل رفع نائب فاعل'},
                                    'هم': {'case': 'مرفوع وعلامة رفعه النون '
                                                   'المحذوفة ',
                                           'case_weak': '',
                                           'cause': 'لاتصاله بنون التوكيد '
                                                    'ولأنه من الأفعال الخمسة',
                                           "description": 'فعل مضارع مؤكّد مبني '
                                                         'للمجهول',
                                           'extra': 'ونون التوكيد لا محل لها '
                                                    'من الإعراب',
                                           'subject': ' والواو: واو الجماعة '
                                                      'المحذوفة ضمير متصل مبني '
                                                      'في محل رفع نائب فاعل'},
                                    'هما': {'case': 'مرفوع وعلامة رفعه النون '
                                                    'المحذوفة ',
                                            'case_weak': '',
                                            'cause': 'لاتصاله بنون التوكيد '
                                                     'ولأنه من الأفعال الخمسة',
                                            "description": 'فعل مضارع مؤكّد '
                                                          'مبني للمجهول',
                                            'extra': 'ونون التوكيد لا محل لها '
                                                     'من الإعراب',
                                            'subject': 'وألف الاثنين: ضمير '
                                                       'متصل مبني في محل رفع '
                                                       'نائب فاعل'},
                                    'هما مؤ': {'case': 'مرفوع وعلامة رفعه '
                                                       'النون المحذوفة ',
                                               'case_weak': '',
                                               'cause': 'لاتصاله بنون التوكيد '
                                                        'ولأنه من الأفعال '
                                                        'الخمسة',
                                               "description": 'فعل مضارع مؤكّد '
                                                             'مبني للمجهول',
                                               'extra': 'ونون التوكيد لا محل '
                                                        'لها من الإعراب',
                                               'subject': 'وألف الاثنين: ضمير '
                                                          'متصل مبني في محل '
                                                          'رفع نائب فاعل'},
                                    'هن': {'case': 'مبني على السكون',
                                           'case_weak': '',
                                           'cause': 'لاتصاله بنون النسوة',
                                           "description": 'فعل مضارع مؤكّد مبني '
                                                         'للمجهول',
                                           'extra': 'ونون التوكيد لا محل لها '
                                                    'من الإعراب',
                                           'subject': 'والنون: ضمير متصل مبني '
                                                      'في محل رفع نائب فاعل'},
                                    'هو': {'case': 'مبني على الفتح',
                                           'case_weak': '',
                                           'cause': 'لاتصاله بنون التوكيد',
                                           "description": 'فعل مضارع مؤكّد مبني '
                                                         'للمجهول',
                                           'extra': 'ونون التوكيد لا محل لها '
                                                    'من الإعراب',
                                           'subject': ''},
                                    'هي': {'case': 'مبني على الفتح',
                                           'case_weak': '',
                                           'cause': 'لاتصاله بنون التوكيد',
                                           "description": 'فعل مضارع مؤكّد مبني '
                                                         'للمجهول',
                                           'extra': 'ونون التوكيد لا محل لها '
                                                    'من الإعراب',
                                           'subject': ''}},
 'المضارع المجزوم': {'أنا': {'case': 'مجزوم وعلامة جزمه السكون الظاهرة على '
                                     'آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'والفاعل ضمير مستتر وجوبًا تقديره أنا'},
                     'أنت': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'والفاعل ضمير مستتر وجوبًا تقديره '
                                        'أنتَ'},
                     'أنتم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                     'أنتما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                               'case_weak': '',
                               'cause': 'لأنه من الأفعال الخمسة',
                               "description": 'فعل مضارع  ',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع فاعل'},
                     'أنتما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                  'case_weak': '',
                                  'cause': 'لأنه من الأفعال الخمسة',
                                  "description": 'فعل مضارع  ',
                                  'extra': '',
                                  'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                             'محل رفع فاعل'},
                     'أنتن': {'case': 'مبني على السكون',
                              'case_weak': '',
                              'cause': 'لاتصاله بنون النسوة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                     'أنتِ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': 'وياء المخاطبة ضمير متصل مبني في محل '
                                         'رفع فاعل'},
                     'نحن': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'ونا: ضمير متصل مبني في محل رفع فاعل'},
                     'هم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                            'case_weak': '',
                            'cause': 'لأنه من الأفعال الخمسة',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                     'هما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                             'case_weak': '',
                             'cause': 'لأنه من الأفعال الخمسة',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                        'رفع فاعل'},
                     'هما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                'case_weak': '',
                                'cause': 'لأنه من الأفعال الخمسة',
                                "description": 'فعل مضارع  ',
                                'extra': '',
                                'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                           'محل رفع فاعل'},
                     'هن': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بنون النسوة',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                     'هو': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                            'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                         'آخره',
                            'cause': '',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ''},
                     'هي': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                            'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                         'آخره',
                            'cause': '',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ''}},
 'المضارع المجهول': {'أنا': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع   مبني للمجهول',
                             'extra': '',
                             'subject': 'ونائب الفاعل ضمير مستتر وجوبًا تقديره '
                                        'أنا'},
                     'أنت': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع   مبني للمجهول',
                             'extra': '',
                             'subject': 'ونائب الفاعل ضمير مستتر وجوبًا تقديره '
                                        'أنتَ'},
                     'أنتم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع   مبني للمجهول',
                              'extra': '',
                              'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                         'نائب فاعل'},
                     'أنتما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                               'case_weak': '',
                               'cause': 'لأنه من الأفعال الخمسة',
                               "description": 'فعل مضارع   مبني للمجهول',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع نائب فاعل'},
                     'أنتما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                  'case_weak': '',
                                  'cause': 'لأنه من الأفعال الخمسة',
                                  "description": 'فعل مضارع   مبني للمجهول',
                                  'extra': '',
                                  'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                             'محل رفع  نائب فاعل'},
                     'أنتن': {'case': 'مبني على السكون',
                              'case_weak': '',
                              'cause': 'لاتصاله بنون النسوة',
                              "description": 'فعل مضارع   مبني للمجهول',
                              'extra': '',
                              'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                         'نائب  فاعل'},
                     'أنتِ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع   مبني للمجهول',
                              'extra': '',
                              'subject': 'وياء المخاطبة ضمير متصل مبني في محل '
                                         'رفع نائب فاعل'},
                     'نحن': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع   مبني للمجهول',
                             'extra': '',
                             'subject': 'ونا: ضمير متصل مبني في محل رفع فاعل'},
                     'هم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                            'case_weak': '',
                            'cause': 'لأنه من الأفعال الخمسة',
                            "description": 'فعل مضارع   مبني للمجهول',
                            'extra': '',
                            'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                       'نائب فاعل'},
                     'هما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                             'case_weak': '',
                             'cause': 'لأنه من الأفعال الخمسة',
                             "description": 'فعل مضارع   مبني للمجهول',
                             'extra': '',
                             'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                        'رفع نائب فاعل'},
                     'هما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                'case_weak': '',
                                'cause': 'لأنه من الأفعال الخمسة',
                                "description": 'فعل مضارع   مبني للمجهول',
                                'extra': '',
                                'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                           'محل رفع نائب فاعل'},
                     'هن': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بنون النسوة',
                            "description": 'فعل مضارع   مبني للمجهول',
                            'extra': '',
                            'subject': 'والنون: ضمير متصل مبني في محل رفع نائب '
                                       'فاعل'},
                     'هو': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                            'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                         'آخره',
                            'cause': '',
                            "description": 'فعل مضارع   مبني للمجهول',
                            'extra': '',
                            'subject': ''},
                     'هي': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                            'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                         'آخره',
                            'cause': '',
                            "description": 'فعل مضارع   مبني للمجهول',
                            'extra': '',
                            'subject': ''}},
 'المضارع المجهول المجزوم': {'أنا': {'case': 'مجزوم وعلامة جزمه السكون الظاهرة '
                                             'على آخره',
                                     'case_weak': 'مرفوع وعلامة رفعه الضمة '
                                                  'المقدرة على آخره',
                                     'cause': '',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'ونائب الفاعل ضمير مستتر '
                                                'وجوبًا تقديره أنا'},
                             'أنت': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة '
                                             'على آخره',
                                     'case_weak': 'مرفوع وعلامة رفعه الضمة '
                                                  'المقدرة على آخره',
                                     'cause': '',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'ونائب الفاعل ضمير مستتر '
                                                'وجوبًا تقديره أنتَ'},
                             'أنتم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                      'case_weak': '',
                                      'cause': 'لأنه من الأفعال الخمسة',
                                      "description": 'فعل مضارع   مبني للمجهول',
                                      'extra': '',
                                      'subject': ' والواو: ضمير متصل مبني في '
                                                 'محل رفع نائب فاعل'},
                             'أنتما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                       'case_weak': '',
                                       'cause': 'لأنه من الأفعال الخمسة',
                                       "description": 'فعل مضارع   مبني للمجهول',
                                       'extra': '',
                                       'subject': 'وألف الاثنين: ضمير متصل '
                                                  'مبني في محل رفع نائب فاعل'},
                             'أنتما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت '
                                                  'النون',
                                          'case_weak': '',
                                          'cause': 'لأنه من الأفعال الخمسة',
                                          "description": 'فعل مضارع   مبني '
                                                        'للمجهول',
                                          'extra': '',
                                          'subject': 'وألف الاثنين: ضمير متصل '
                                                     'مبني في محل رفع نائب '
                                                     'فاعل'},
                             'أنتن': {'case': 'مبني على السكون',
                                      'case_weak': '',
                                      'cause': 'لاتصاله بنون النسوة',
                                      "description": 'فعل مضارع   مبني للمجهول',
                                      'extra': '',
                                      'subject': 'والنون: ضمير متصل مبني في '
                                                 'محل رفع نائب فاعل'},
                             'أنتِ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                      'case_weak': '',
                                      'cause': 'لأنه من الأفعال الخمسة',
                                      "description": 'فعل مضارع   مبني للمجهول',
                                      'extra': '',
                                      'subject': 'وياء المخاطبة ضمير متصل مبني '
                                                 'في محل رفع نائب فاعل'},
                             'نحن': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة '
                                             'على آخره',
                                     'case_weak': 'مرفوع وعلامة رفعه الضمة '
                                                  'المقدرة على آخره',
                                     'cause': '',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'ونا: ضمير متصل مبني في محل '
                                                'رفع نائب فاعل'},
                             'هم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                    'case_weak': '',
                                    'cause': 'لأنه من الأفعال الخمسة',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': ' والواو: ضمير متصل مبني في محل '
                                               'رفع نائب فاعل'},
                             'هما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                     'case_weak': '',
                                     'cause': 'لأنه من الأفعال الخمسة',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'وألف الاثنين: ضمير متصل مبني '
                                                'في محل رفع نائب فاعل'},
                             'هما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                        'case_weak': '',
                                        'cause': 'لأنه من الأفعال الخمسة',
                                        "description": 'فعل مضارع   مبني '
                                                      'للمجهول',
                                        'extra': '',
                                        'subject': 'وألف الاثنين: ضمير متصل '
                                                   'مبني في محل رفع نائب فاعل'},
                             'هن': {'case': 'مبني على السكون',
                                    'case_weak': '',
                                    'cause': 'لاتصاله بنون النسوة',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': 'والنون: ضمير متصل مبني في محل '
                                               'رفع نائب فاعل'},
                             'هو': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة '
                                            'على آخره',
                                    'case_weak': 'مرفوع وعلامة رفعه الضمة '
                                                 'المقدرة على آخره',
                                    'cause': '',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': ''},
                             'هي': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة '
                                            'على آخره',
                                    'case_weak': 'مرفوع وعلامة رفعه الضمة '
                                                 'المقدرة على آخره',
                                    'cause': '',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': ''}},
 'المضارع المجهول المنصوب': {'أنا': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                                     'case_weak': 'منصوب بالفتحة المقدرة منع '
                                                  'من ظهورها التعذّر',
                                     'cause': '',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': ''},
                             'أنت': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                                     'case_weak': 'منصوب بالفتحة المقدرة منع '
                                                  'من ظهورها التعذّر',
                                     'cause': '',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'ونائب الفاعل ضمير مستتر '
                                                'وجوبًا تقديره أنتَ'},
                             'أنتم': {'case': 'منصوب بحذف النون',
                                      'case_weak': '',
                                      'cause': 'لأنه من الأفعال الخمسة',
                                      "description": 'فعل مضارع   مبني للمجهول',
                                      'extra': '',
                                      'subject': ' والواو: ضمير متصل مبني في '
                                                 'محل رفع نائب فاعل'},
                             'أنتما': {'case': 'منصوب بحذف النون',
                                       'case_weak': '',
                                       'cause': 'لأنه من الأفعال الخمسة',
                                       "description": 'فعل مضارع   مبني للمجهول',
                                       'extra': '',
                                       'subject': 'وألف الاثنين: ضمير متصل '
                                                  'مبني في محل رفع نائب فاعل'},
                             'أنتما مؤ': {'case': 'منصوب بحذف النون',
                                          'case_weak': '',
                                          'cause': 'لأنه من الأفعال الخمسة',
                                          "description": 'فعل مضارع   مبني '
                                                        'للمجهول',
                                          'extra': '',
                                          'subject': 'وألف الاثنين: ضمير متصل '
                                                     'مبني في محل رفع نائب '
                                                     'فاعل'},
                             'أنتن': {'case': 'مبني على السكون',
                                      'case_weak': '',
                                      'cause': 'لاتصاله بنون النسوة',
                                      "description": 'فعل مضارع   مبني للمجهول',
                                      'extra': '',
                                      'subject': 'والنون: ضمير متصل مبني في '
                                                 'محل رفع نائب فاعل'},
                             'أنتِ': {'case': 'منصوب بحذف النون',
                                      'case_weak': '',
                                      'cause': 'لأنه من الأفعال الخمسة',
                                      "description": 'فعل مضارع   مبني للمجهول',
                                      'extra': '',
                                      'subject': 'وياء المخاطبة ضمير متصل مبني '
                                                 'في محل رفع نائب فاعل'},
                             'نحن': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                                     'case_weak': 'منصوب بالفتحة المقدرة منع '
                                                  'من ظهورها التعذّر',
                                     'cause': '',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'ونا: ضمير متصل مبني في محل '
                                                'رفع نائب فاعل'},
                             'هم': {'case': 'منصوب بحذف النون',
                                    'case_weak': '',
                                    'cause': 'لأنه من الأفعال الخمسة',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': ' والواو: ضمير متصل مبني في محل '
                                               'رفع نائب فاعل'},
                             'هما': {'case': 'منصوب بحذف النون',
                                     'case_weak': '',
                                     'cause': 'لأنه من الأفعال الخمسة',
                                     "description": 'فعل مضارع   مبني للمجهول',
                                     'extra': '',
                                     'subject': 'وألف الاثنين: ضمير متصل مبني '
                                                'في محل رفع نائب فاعل'},
                             'هما مؤ': {'case': 'منصوب بحذف النون',
                                        'case_weak': '',
                                        'cause': 'لأنه من الأفعال الخمسة',
                                        "description": 'فعل مضارع   مبني '
                                                      'للمجهول',
                                        'extra': '',
                                        'subject': 'وألف الاثنين: ضمير متصل '
                                                   'مبني في محل رفع نائب فاعل'},
                             'هن': {'case': 'مبني على السكون',
                                    'case_weak': '',
                                    'cause': 'لاتصاله بنون النسوة',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': 'والنون: ضمير متصل مبني في محل '
                                               'رفع نائب فاعل'},
                             'هو': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                                    'case_weak': 'منصوب بالفتحة المقدرة منع من '
                                                 'ظهورها التعذّر',
                                    'cause': '',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': ''},
                             'هي': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                                    'case_weak': 'منصوب بالفتحة المقدرة منع من '
                                                 'ظهورها التعذّر',
                                    'cause': '',
                                    "description": 'فعل مضارع   مبني للمجهول',
                                    'extra': '',
                                    'subject': ''}},
 'المضارع المعلوم': {'أنا': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'والفاعل ضمير مستتر وجوبًا تقديره أنا'},
                     'أنت': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'والفاعل ضمير مستتر وجوبًا تقديره '
                                        'أنتَ'},
                     'أنتم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                     'أنتما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                               'case_weak': '',
                               'cause': 'لأنه من الأفعال الخمسة',
                               "description": 'فعل مضارع  ',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع فاعل'},
                     'أنتما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                  'case_weak': '',
                                  'cause': 'لأنه من الأفعال الخمسة',
                                  "description": 'فعل مضارع  ',
                                  'extra': '',
                                  'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                             'محل رفع فاعل'},
                     'أنتن': {'case': 'مبني على السكون',
                              'case_weak': '',
                              'cause': 'لاتصاله بنون النسوة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                     'أنتِ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': 'وياء المخاطبة ضمير متصل مبني في محل '
                                         'رفع فاعل'},
                     'نحن': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                             'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                          'آخره',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'ونا: ضمير متصل مبني في محل رفع فاعل'},
                     'هم': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                            'case_weak': '',
                            'cause': 'لأنه من الأفعال الخمسة',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                     'هما': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                             'case_weak': '',
                             'cause': 'لأنه من الأفعال الخمسة',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                        'رفع فاعل'},
                     'هما مؤ': {'case': 'مرفوع وعلامة رفعه ثبوت النون',
                                'case_weak': '',
                                'cause': 'لأنه من الأفعال الخمسة',
                                "description": 'فعل مضارع  ',
                                'extra': '',
                                'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                           'محل رفع فاعل'},
                     'هن': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بنون النسوة',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                     'هو': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                            'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                         'آخره',
                            'cause': '',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ''},
                     'هي': {'case': 'مرفوع وعلامة رفعه الضمة الظاهرة على آخره',
                            'case_weak': 'مرفوع وعلامة رفعه الضمة المقدرة على '
                                         'آخره',
                            'cause': '',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ''}},
 'المضارع المنصوب': {'أنا': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                             'case_weak': 'منصوب بالفتحة المقدرة منع من ظهورها '
                                          'التعذّر',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'والفاعل ضمير مستتر وجوبًا تقديره أنا'},
                     'أنت': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                             'case_weak': 'منصوب بالفتحة المقدرة منع من ظهورها '
                                          'التعذّر',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'والفاعل ضمير مستتر وجوبًا تقديره '
                                        'أنتَ'},
                     'أنتم': {'case': 'منصوب بحذف النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                     'أنتما': {'case': 'منصوب بحذف النون',
                               'case_weak': '',
                               'cause': 'لأنه من الأفعال الخمسة',
                               "description": 'فعل مضارع  ',
                               'extra': '',
                               'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                          'رفع فاعل'},
                     'أنتما مؤ': {'case': 'منصوب بحذف النون',
                                  'case_weak': '',
                                  'cause': 'لأنه من الأفعال الخمسة',
                                  "description": 'فعل مضارع  ',
                                  'extra': '',
                                  'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                             'محل رفع فاعل'},
                     'أنتن': {'case': 'مبني على السكون',
                              'case_weak': '',
                              'cause': 'لاتصاله بنون النسوة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                         'فاعل'},
                     'أنتِ': {'case': 'منصوب بحذف النون',
                              'case_weak': '',
                              'cause': 'لأنه من الأفعال الخمسة',
                              "description": 'فعل مضارع  ',
                              'extra': '',
                              'subject': 'وياء المخاطبة ضمير متصل مبني في محل '
                                         'رفع فاعل'},
                     'نحن': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                             'case_weak': 'منصوب بالفتحة المقدرة منع من ظهورها '
                                          'التعذّر',
                             'cause': '',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'ونا: ضمير متصل مبني في محل رفع فاعل'},
                     'هم': {'case': 'منصوب بحذف النون',
                            'case_weak': '',
                            'cause': 'لأنه من الأفعال الخمسة',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ' والواو: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                     'هما': {'case': 'منصوب بحذف النون',
                             'case_weak': '',
                             'cause': 'لأنه من الأفعال الخمسة',
                             "description": 'فعل مضارع  ',
                             'extra': '',
                             'subject': 'وألف الاثنين: ضمير متصل مبني في محل '
                                        'رفع فاعل'},
                     'هما مؤ': {'case': 'منصوب بحذف النون',
                                'case_weak': '',
                                'cause': 'لأنه من الأفعال الخمسة',
                                "description": 'فعل مضارع  ',
                                'extra': '',
                                'subject': 'وألف الاثنين: ضمير متصل مبني في '
                                           'محل رفع فاعل'},
                     'هن': {'case': 'مبني على السكون',
                            'case_weak': '',
                            'cause': 'لاتصاله بنون النسوة',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': 'والنون: ضمير متصل مبني في محل رفع '
                                       'فاعل'},
                     'هو': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                            'case_weak': 'منصوب بالفتحة المقدرة منع من ظهورها '
                                         'التعذّر',
                            'cause': '',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ''},
                     'هي': {'case': 'منصوب بالفتحة الظاهرة على آخره',
                            'case_weak': 'منصوب بالفتحة المقدرة منع من ظهورها '
                                         'التعذّر',
                            'cause': '',
                            "description": 'فعل مضارع  ',
                            'extra': '',
                            'subject': ''}}}
